students = {
    "Бондаренко Марія Миколаївна": {
        "номер_групи": "Група 101",
        "курс": 1,
        "предмети_та_оцінки": {
            "Вища математика": [90, 85, 92],
            "Фізика": [88, 80, 84],
            "Програмування": [95, 97, 94],
        },
    },
    "Сидоренко Андрій Андрійович": {
        "номер_групи": "Група 102",
        "курс": 2,
        "предмети_та_оцінки": {
            "Вища математика": [78, 85, 82],
            "Програмування": [80, 79, 88],
            "Організація IT бізнесу": [88, 80, 84],
        },
    },
    "Коваленко Ольга Сергіївна": {
        "номер_групи": "Група 103",
        "курс": 3,
        "предмети_та_оцінки": {
            "Чисельні методи": [91, 89, 93],
            "Алгоритми і структури даних": [85, 87, 90],
            "Програмування": [82, 84, 80],
        },
    },
}


def printAllStudents(students):  # Функцію написав Цебро
    for ПІБ, info in students.items():
        print(f"Прізвище, ім'я, по батькові: {ПІБ}")
        print(f"Номер групи: {info['номер_групи']}")
        print(f"Курс: {info['курс']}")
        print("Предмети та оцінки:")
        for предмет, оцінки in info["предмети_та_оцінки"].items():
            оцінки_str = ", ".join(map(str, оцінки))
            print(f"  {предмет}: {оцінки_str}")
        print("-" * 40)


def main():
    while True:
        print("\nМеню:")
        print("1. Вивести всіх студентів")
        print("2. Вийти")

        choice = input("Виберіть опцію (1-2): ")

        if choice == "1":
            printAllStudents(students)
        elif choice == "2":
            print("Вихід з програми.")
            break
        else:
            print("Невірний вибір. Спробуйте ще раз.")


main()
